reacting/burner_CH4_noWall/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    burner
    {
        type            noSlip;
    }
    wall
    {
        type            noSlip;
    }
    outlet
    {
        type            zeroGradient;
    }
    f_front
    {
        type            wedge;
    }
    f_back
    {
        type            wedge;
    }
    fuel
    {
        type            fixedValue;
        value           uniform (0 0.66 0);
    }
    shield
    {
        type            fixedValue;
        value           uniform (0 0.11 0);
    }
}


// ************************************************************************* //
