reacting/burner_CH4_noWall/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 300
    volVectorFieldValue U (0 0 0)
);

regions
(
    boxToCell
    {
        box (0.0 0.1 -1.0) (0.030226 0.11 1.0);
        fieldValues
        (
            volScalarFieldValue T 1800
            volVectorFieldValue U (0 0.66 0)
        );
    }

    boxToCell
    {
        box (0.030226 0.1 -1.0) (0.036703 0.11 1.0);
        fieldValues
        (
            volScalarFieldValue T 300
            volVectorFieldValue U (0 0.11 0)
        );
    }
);

// ************************************************************************* //
